StoneRose35/cortexguitarfx/Src/rp2040/core1Main.c
#include "globalConfig.h"
#include "system.h"
#include "drivers/dma.h"
#include "drivers/multicore.h"
#include "core1Main.h"
#include "drivers/gpio.h"
#include "drivers/irq.h"
#include "drivers/oled_display.h"
#include "audio/firFilter.h"
#include "audio/audiotools.h"
#include "audio/delay.h"
#include "pipicofx/fxPrograms.h"
#include "pipicofx/pipicofxui.h"
#include "pipicofx/picofxCore.h"
#include "drivers/adc.h"
#include "stringFunctions.h"
#include "drivers/rotEncoderSwitchPower.h"
#include "drivers/stompswitches.h"
#include "drivers/systick.h"
#include "hardware/regs/addressmap.h"
#include "hardware/regs/sio.h"
#include "hardware/regs/dma.h"
#include "hardware/regs/m0plus.h"
#include "hardware/rp2040_registers.h"
#include "consoleBase.h"


int16_t firstHalfOut;
FirFilterType**core1FirData;
extern volatile uint32_t task;
extern volatile int16_t avgOutOld;
extern volatile int16_t avgInOld;
extern volatile uint8_t fxProgramIdx;
extern volatile uint32_t cpuLoad;
extern volatile uint8_t programsActivated;
extern volatile uint8_t programChangeState;
extern volatile uint8_t programsToInitialize[3];
extern const uint8_t stompswitch_progs[];
extern PiPicoFxUiType piPicoUiController;
int16_t avgOldOutBfr;
int16_t avgOldInBfr;
uint8_t cpuLoadBfr;
int16_t encoderDelta;
RotaryEncoderIncrementType rotaryEncoderInfo;
uint8_t switchVals[2]={0,0};
//PiPicoFxUiType uiControllerData;
uint16_t adcChannelOld0=0,adcChannel0=0;
uint16_t adcChannelOld1=0,adcChannel1=0;
uint16_t adcChannelOld2=0,adcChannel2=0;
uint16_t adcChannel=0;
uint8_t stompSwitchState;
FxPresetType preset1, preset2;



static volatile uint32_t * audioStatePtr;
#define UI_DMIN 1
#define ADC_LOWPASS 2
#define ROTARY_ENCODER_LOWER_SPEED_LIMIT 80000

const uint8_t switchesPins[2]={ENTER_SWITCH,EXIT_SWITCH};

void isr_c1_sio_irq_proc1_irq16() // only fires when a fir computation has to be made
{
    if ((*SIO_FIFO_ST & (1 << SIO_FIFO_ST_VLD_LSB))!= 0)
    {
        core1FirData = (FirFilterType**)*SIO_FIFO_RD;
        firstHalfOut = processFirstHalf(*core1FirData);
        *SIO_FIFO_WR = firstHalfOut;
    }
    else if (((*SIO_FIFO_ST & (1 << SIO_FIFO_ST_ROE_LSB)) != 0) || ((*SIO_FIFO_ST & (1 << SIO_FIFO_ST_WOF_LSB)) != 0))
    {
        *SIO_FIFO_ST = (1 << 2);
    }
}

void core1Main()
{
    audioStatePtr = getAudioStatePtr();


    	initOledDisplay();

	/*
     *
     * Initialize Background Services
     *
	 */

	
	piPicoFxUiSetup(&piPicoUiController);
	OledClearDisplay();
    *DMA_INTE0 |= (1 << 4);
	for (uint8_t c=0;c<N_FX_PROGRAMS;c++)
	{
		if ((uint32_t)fxPrograms[c]->setup != 0)
		{
			fxPrograms[c]->setup(fxPrograms[c]->data);
		}
	}
	#ifndef FORCE_TEST_MODE
		enterLevel0(&piPicoUiController);
	#else
	    // switch on program "off"
		piPicoUiController.currentProgramIdx = N_FX_PROGRAMS-1;
		piPicoUiController.currentProgram=fxPrograms[piPicoUiController.currentProgramIdx];
	    enterLevel7(&piPicoUiController);
	#endif

    // initalized the rotary encoder and the switches so that core 1 handler the interrupts of the ui elements
    initRotaryEncoder(switchesPins,2);
    #ifdef EXTENSION_BOARD
    initStompSwitchesInterface();
    #endif
    initRoundRobinReading(); // internal adc for reading parameters

    setAsOutput(CLIPPING_LED_INPUT);
    setAsOutput(CLIPPING_LED_OUTPUT);

    #ifdef EXTENSION_BOARD
    setStompswitchColorRaw(0);
    #endif

    *NVIC_ISER = (1 << 16) | (1 << 23) | (1 << 11); // enable interrupt for dma,sio and i2c of proc1 
    setInterruptPriority(11,1);
    *SIO_FIFO_ST = (1 << 2);
    *SIO_FIFO_WR=0xcafeface; // write sync word for core 0 to wait for core 1

    for(;;)
    {
        if ((task & (1 << TASK_UPDATE_POTENTIOMETER_VALUES)) == (1 << TASK_UPDATE_POTENTIOMETER_VALUES))
        {
            // call the update function of the chosen program
            adcChannel = getChannel0Value();
            adcChannel0 = adcChannel0 + ((ADC_LOWPASS*(adcChannel - adcChannel0)) >> 8);
            if ((adcChannel0 > adcChannelOld0) && (adcChannel0-adcChannelOld0) > UI_DMIN )
            {
                onKnob0(adcChannel0,&piPicoUiController);
                adcChannelOld0=adcChannel0;
            }
            else if ((adcChannel0 < adcChannelOld0) && (adcChannelOld0-adcChannel0) > UI_DMIN )
            {
                onKnob0(adcChannel0,&piPicoUiController);
                adcChannelOld0=adcChannel0;
            }

            adcChannel = getChannel1Value();
            adcChannel1 = adcChannel1 + ((ADC_LOWPASS*(adcChannel - adcChannel1)) >> 8);
            if ((adcChannel1 > adcChannelOld1) && (adcChannel1-adcChannelOld1) > UI_DMIN )
            {
                onKnob1(adcChannel1,&piPicoUiController);
                adcChannelOld1=adcChannel1;
            }
            else if ((adcChannel1 < adcChannelOld1) && (adcChannelOld1-adcChannel1) > UI_DMIN )
            {
                onKnob1(adcChannel1,&piPicoUiController);
                adcChannelOld1=adcChannel1;
            }

            adcChannel = getChannel2Value();
            adcChannel2 = adcChannel2 + ((ADC_LOWPASS*(adcChannel - adcChannel2)) >> 8);
            if ((adcChannel2 > adcChannelOld2) && (adcChannel2-adcChannelOld2) > UI_DMIN )
            {
                onKnob2(adcChannel2,&piPicoUiController);
                adcChannelOld2=adcChannel2;
            }
            else if ((adcChannel2 < adcChannelOld2) && (adcChannelOld2-adcChannel) > UI_DMIN )
            {
                onKnob2(adcChannel2,&piPicoUiController);
                adcChannelOld2=adcChannel;
            }
            task &= ~(1 << TASK_UPDATE_POTENTIOMETER_VALUES);
        }
        if ((task & (1 << TASK_UPDATE_AUDIO_UI)) == (1 << TASK_UPDATE_AUDIO_UI))
        {
            avgOldInBfr = avgInOld >> 8;
            avgOldOutBfr = avgOutOld >> 8;
            cpuLoadBfr = (cpuLoad >> 1);
            onUpdate(avgOldInBfr,avgOldOutBfr,cpuLoadBfr,&piPicoUiController);
            #ifndef FORCE_TEST_MODE
            if ((*audioStatePtr & (1 << AUDIO_STATE_INPUT_CLIPPED)) == (1 << AUDIO_STATE_INPUT_CLIPPED))
            {
                setPin(CLIPPING_LED_INPUT,CLIPPING_LED_POLARITY ^ 1);
                *audioStatePtr &= ~(1 << AUDIO_STATE_INPUT_CLIPPED);
            }
            else
            {
                setPin(CLIPPING_LED_INPUT,CLIPPING_LED_POLARITY);
            }
            if ((*audioStatePtr & (1 << AUDIO_STATE_OUTPUT_CLIPPED)) == (1 << AUDIO_STATE_OUTPUT_CLIPPED))
            {
                setPin(CLIPPING_LED_OUTPUT,CLIPPING_LED_POLARITY ^ 1);
                *audioStatePtr &= ~(1 << AUDIO_STATE_OUTPUT_CLIPPED);
            }
            else
            {
                setPin(CLIPPING_LED_OUTPUT,CLIPPING_LED_POLARITY);
            }
            #endif
            
            task &= ~(1 << TASK_UPDATE_AUDIO_UI);
        }

        if ((task & (1 << TASK_I2C_DATA_RECEIVED))!=0)
        {

            handleSwitchesUpdate(I2CGetReceivedData());
            task &= ~(1 << TASK_I2C_DATA_RECEIVED);
        }

        /*
         *
         * UI Switches Callback
         * 
        */
        switchVals[0] = getSwitchValue(0);
        if ((switchVals[0] & 1) > 0)
        {
            onEnterPressed(&piPicoUiController);
            clearPressedStickyBit(0);
        }
        if((switchVals[0] & 2) > 0)
        {
            onEnterReleased(&piPicoUiController);
            clearReleasedStickyBit(0);
        }

        switchVals[1] = getSwitchValue(1);
        if ((switchVals[1] & 1) > 0)
        {
            onExitPressed(&piPicoUiController);
            clearPressedStickyBit(1);
        }
        if ((switchVals[1] & 2) > 0)
        {
            onExitReleased(&piPicoUiController);
            clearReleasedStickyBit(1);
        }

       getStickyIncrementAndTime(&rotaryEncoderInfo);
       if (rotaryEncoderInfo.increment != 0)
       {
            int32_t d_enc; 
            #ifdef ENCODER_TUNE
            char chrbfr[32];
            chrbfr[0]=0;
            #endif
            
            if (rotaryEncoderInfo.deltaTime > ROTARY_ENCODER_LOWER_SPEED_LIMIT)
            {
                if (rotaryEncoderInfo.increment > 0)
                {
                    d_enc = 1;
                }
                else
                {
                    d_enc = -1;
                }
            }
            else if (rotaryEncoderInfo.deltaTime != 0)
            {
                d_enc = rotaryEncoderInfo.increment * ROTARY_ENCODER_LOWER_SPEED_LIMIT;
                d_enc /= (int32_t)rotaryEncoderInfo.deltaTime; 
                #ifdef ENCODER_TUNE
                appendToString(chrbfr,"d_time: ");
                printf(chrbfr);
                UInt32ToChar(rotaryEncoderInfo.deltaTime,chrbfr);
                printf(chrbfr);
                chrbfr[0]='\r';
                chrbfr[1]='\n';
                chrbfr[2]=0;
                printf(chrbfr);
                #endif
            }
            else
            {
                d_enc = rotaryEncoderInfo.increment * ROTARY_ENCODER_LOWER_SPEED_LIMIT;
            }
            encoderDelta = (int16_t)d_enc;
            #ifdef ENCODER_TUNE
            appendToString(chrbfr, "enc delta: ");
            printf(chrbfr);
            Int16ToChar(encoderDelta,chrbfr);
            printf(chrbfr);
            chrbfr[0]='\r';
            chrbfr[1]='\n';
            chrbfr[2]=0;
            printf(chrbfr);
            #endif
            onRotaryChange(encoderDelta,&piPicoUiController);
            clearStickyIncrementDelta();
        }

       /*
        *
        * Stomp Switches Callback
        * 
       */
        #ifdef EXTENSION_BOARD
        stompSwitchState = getStompSwitchState(0);
        if ((stompSwitchState & (1 << 1)) != 0) 
        {
            clearStompSwitchStickyPressed(0);
            onStompSwitch1Pressed(&piPicoUiController);
        }
        if ((stompSwitchState & (1 << 2)) != 0)
        {
            clearStompSwitchStickyReleased(0);
            onStompSwitch1Released(&piPicoUiController);
        }
        stompSwitchState = getStompSwitchState(1);
        if ((stompSwitchState & (1 << 1)) != 0) 
        {
            clearStompSwitchStickyPressed(1);
            onStompSwitch2Pressed(&piPicoUiController);
        }
        if ((stompSwitchState & (1 << 2)) != 0)
        {
            clearStompSwitchStickyReleased(1);
            onStompSwitch2Released(&piPicoUiController);
        }
        stompSwitchState = getStompSwitchState(2);
        if ((stompSwitchState & (1 << 1)) != 0) 
        {
            clearStompSwitchStickyPressed(2);
            onStompSwitch3Pressed(&piPicoUiController);
        }
        if ((stompSwitchState & (1 << 2)) != 0)
        {
            clearStompSwitchStickyReleased(2);
            onStompSwitch3Released(&piPicoUiController);
        }


        if (programChangeState == 3)
        {
            clearDelayLine();
            if (programsToInitialize[0] != 0xFF)
            {
                if (fxPrograms[programsToInitialize[0]]->reset != 0)
                {
                    fxPrograms[programsToInitialize[0]]->reset(fxPrograms[programsToInitialize[0]]->data);
                }
                piPicoUiController.currentProgramIdx = programsToInitialize[0];
                programsToInitialize[0]=0xFF;
                piPicoUiController.currentProgram = fxPrograms[piPicoUiController.currentProgramIdx];
                onCreate(&piPicoUiController);
            }

            programChangeState = 4;
        }
        #endif
    }
}